Revit 2024 API
BaseArray.NumMembers Property
Retrieves or changes the number of the arrayed members.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public abstract int NumMembers { get; set; }
Visual Basic
Public MustOverride Property NumMembers As Integer
	Get
	Set
Visual C++
public:
virtual property int NumMembers {
	int get () abstract;
	void set (int value) abstract;
}
See Also
BaseArray Class
Autodesk.Revit.DB Namespace